app/controllers/todos_controller.rb

    def get_todos
        render json: Todo.all
---
SELECT "todos".* FROM "todos"

     def create
    #     title = todo_params[:title]
    #     description = todo_params[:description]
    #     priority = todo_params[:priority]

    #     #add todos in db
    #     todo = Todo.create(title: title, description: description, priority: priority)
    #     render json: todo
    #

    todo = Todo.create(todo_params)
---
INSERT INTO "todos" ("title", "description", "status", "priority", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

def update
    id = params[:id]
    todo = Todo.find(id.to_i)
    todo.update(todo_params)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["priority", 2], ["updated_at", "2023-03-15 09:02:38.955213"], ["id", 1]]

def destroy
    id = params[:id]
    todo = Todo.find(id.to_i)
    todo.destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]