app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
def index
    render json: {data: User.all}

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "solon@g.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-21 08:10:43.663931"], ["updated_at", "2023-03-21 08:10:43.663931"]]
---
    def create
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "mine@mail.com"], ["password_digest", "[FILTERED]"], ["updated_at", "2023-03-17 08:56:17.565502"], ["id", 6]]
---
    def update
        id = params[:id].to_i
        user = User.find(id)
        user.update(user_params)